Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: ཅི་རིན་པོ་ཆེའི་གླིང་དུ་རླུང་ལངས་སམ། ཡང་ན་ནི་ནས་ཀྱི་གླིང་དུ་རླུང་ལངས་སམ། འོན་ཏེ་སྲིན་མོའི་གླིང་དུ་རླུང་ལངས་ཞེས་སྨྲས་པ་དང་།
en: Are the winds blowing toward Ratnadvīpa, or are the winds blowing toward Yavanadvīpa, or are the winds blowing toward the island of the rākṣasīs?’

source: གདོས་འཛིན་པ་འདི་སྐད་ཅེས་ཟེར་ཏེ།
en: “The pilot answered,

source: བསེར་མ་ནི་སིང་གྷ་ལའི་གླིང་དུ་ལངས་ཀྱིས་ལྷ་མཁྱེན་པར་མཛོད་ཅིག །
en: ‘Know this, lord: the breeze is blowing toward Siṃhala Island.’

source: དེ་ནས་གྲུ་བོ་ཆེ་བཏང་སྟེ་སིང་གྷ་ལའི་གླིང་དུ་སོང་བ་
en: “So we set sail in the great ship in the direction of Siṃhala Island,

source: ལས་སིང་གྷ་ལའི་གླིང་ན་གནས་པའི་སྲིན་མོ་དག་གིས་དུས་མ་ཡིན་པའི་རླུང་བཏང་བ་དང་
en: but the rākṣasīs who lived on Siṃhala Island sent untimely winds

source: གྲུ་བོ་ཆེ་དེ་དུམ་བུ་དུམ་བུར་ལྷགས་ནས་ཚོང་པ་དེ་དག་ཆུའི་ནང་དུ་ལྷུང་བ་དང་།
en: that broke the great ship into pieces. We fell into the water and

source: བརྐྱལ་ནས་ཆུའི་འགྲམ་དུ་ཉེ་བར་ཕྱིན་ཏོ། །
en: swam to the shore.

source: དེ་ནས་སྲིན་མོ་ལྔ་བརྒྱ་གཞོན་ནུའི་གཟུགས་སུ་བསྒྱུར་ཏེ་
en: “Five hundred rākṣasīs took on the form of maidens,

source: སྒྲ་ཅ་ཅོ་ཟེར་ཞིང་བྱུང་ནས་ཆུ་འགྲམ་དེ་དང་ཉེ་བ་ཞིག་ཏུ་འོངས་ཏེ་
en: and with a great cry came down to the shore.

source: བླ་གོས་ཀྱི་རས་བྱིན་ནས་བསླང་བ་དང་།
en: They gave us cotton robes.

source: དེ་དག་བདག་བདག་གི་གོས་འཚིར་རོ།
en: We put them on, wrung our clothes dry,

source: བཙིར་ནས་དེ་དག་གནས་དེ་ནས་གནས་གཞན་དུ་ཤིང་ཙམ་པ་ཀ་ཆེན་པོ་ཡོད་པ་དེའི་དྲུང་དུ་ངལ་བསོས་སོ། །
en: and went to sit under a large magnolia tree.

source: ངལ་བསོས་ནས་བདག་ཅག་ལ་ཐབས་ཅི་ཡོད་ཅེས་གཏམ་བྱས་པ་དང་།
en: Seated, we talked among ourselves, asking each other what we should do,

source: དེ་དག་གིས་བདག་ཅག་ལ་ཐབས་མ་མཆིས་སོ་ཞེས་དེ་སྐད་སྨྲས་ནས་ཁ་རོག་སྟེ་འཁོད་དོ།
en: but we agreed that there was nothing we could do, and we became silent.

source: དེ་ནས་སྲིན་མོ་དེ་དག་དེ་རྣམས་ཀྱི་མདུན་དུ་འདུག་ནས་ཁྱོ་མ་མཆིས་པའི་ནི་ཁྱོ་མཛོད་ཅིག །
en: “The rākṣasīs came to us and said, ‘You who are not masters of a house, become masters.

source: གནས་མ་མཆིས་པའི་ནི་གནས་མཛོད་ཅིག །
en: You who have no refuge, obtain a refuge.

source: རྟེན་མ་མཆིས་པའི་ནི་རྟེན་མཛོད་ཅིག །
en: You who have no home, obtain a home.

source: འདི་དག་ནི་ཁྱོད་ཀྱི་ཟས་ཀྱི་ཁྱིམ་མོ། །སྐོམ་གྱི་ཁྱིམ་མོ། །སྐྱེད་མོས་ཚལ་དགའ་བར་བགྱིད་པའོ།
en: These will be your homes supplied with food. These will be your homes supplied with drink. These will be your gardens for you to enjoy.

source: རྫིང་བུ་དགའ་བར་བགྱིད་པའོ། །
en: These will be your bathing pools for you to enjoy.’

source: ཞེས་དེ་སྐད་སྨྲས་ནས་སྲིན་མོ་དེ་དག་གིས་སྐྱེས་པ་རེ་རེ་ཁྲིད་དེ་བདག་བདག་གི་ཁྱིམ་དུ་སོང་ངོ་། །
en: “After the rākṣasīs had spoken to us thus, each one took a merchant home to be the master of her house.

source: གང་སྲིན་མོ་དེ་དག་གི་ནང་ན་ཤིན་ཏུ་རྒན་པ་དེས་བདག་གི་ཁྱིམ་དུ་ང་ཁྲིད་ནས་
en: The senior rākṣasī took me home to be the master of her house.

source: ལྷའི་རོའི་རོ་མཆོག་དང་ལྡན་པས་ཚིམ་པར་བྱས་སོ། །
en: She satisfied me with food that had perfect, divine flavors.

source: ཚིམ་པར་བྱས་ནས་རྩེ་བར་རྩོམ་སྟེ།
en: Having satisfied me with food, she frolicked with me,

source: དེ་ལ་དེས་མིའི་བདེ་བས་ཚིམ་པར་བྱས་ནས་དེ་བཞིན་དུ་ཉི་མ་གཉིས་གསུམ་ནས་བདུན་འདས་སོ།
en: and in this way I was perfectly satisfied with human pleasures. Two or three weeks passed in that manner.

source: རེ་ཞིག་ན་མོ་ཉལ་ཏེ་གཉིད་ཀྱིས་ལོག་པ་དང་གད་མོ་སྙན་པར་དགོད་པ་ངས་མཐོང་ནས་ང་ངོ་མཚར་དུ་གྱུར་ཏེ། །
en: “One night as I was lying in bed, I was astonished to see that the lamp was laughing.

source: གཉིད་ལོག་བཞིན་དུ་གད་མོ་སྙན་པར་དགོད་པ་ངས་ནམ་ཡང་མ་མཐོང་། མ་ཐོས་སོ།
en: I had never seen or heard before of a burning, laughing lamp.

source: སྙམ་ནས་དེའི་ཚེ་ངས་དེ་ལ་ཁྱོད་ཅིའི་ཕྱིར། དགོད་ཅེས་སྨྲས་པ་དང་།
en: I asked it, ‘Why are you laughing?’

source: མོ་ན་རེ་འདི་དག་ནི་སིང་གྷ་ལའི་གླིང་ན་གནས་པའི་སྲིན་མོ་ལགས་ཏེ། །
en: “It answered, ‘This is one of the rākṣasīs who live on Siṃhala Island.

source: ཁྱེད་ཀྱི་སྲོག་བཅད་ད་རེ་ཞེས་ཟེར་ནས་
en: She is going to kill you.’

source: དེའི་ཚེ་ངས་དེ་ལ་འདི་དག་སྲིན་མོ་ཡིན་པར་ཁོ་བོས་ཇི་ལྟར་ཤེས་པར་བྱ་ཞེས་དྲིས་པ་དང་།
en: “I asked it, ‘How do you know she is a rākṣasī?’

source: དེ་སྟེ་ཡིད་མི་ཆེས་ན་གཡས་ཕྱོགས་ཀྱི་ལམ་སྲང་ཟུང་སྟེ་བཞུད་ཅིག་དང་།
en: “It answered, ‘If you don’t believe me, take the road south and follow it.

source: དེ་ན་ལྕགས་ཀྱི་གྲོང་ཁྱེར་མཐོ་བ་སྐར་ཁུང་དང་རྟ་བབས་མེད་པ་ཞིག་མཆིས་ཏེ། །
en: You will come to a high fortress without windows or doorways.

source: དེ་ན་ཚོང་པ་བརྒྱ་ཕྲག་དུ་མ་འཚལ་ཅིང་བོར་ནས་ལ་ལ་ནི་གསོན།
en: Many hundreds of merchants have been thrown in there. Some are alive.

source: ལ་ལ་ནི་གུམ་སྟེ།
en: Some are dead.

source: ཁྱོད་དེ་ལྟར་ཐུགས་མི་ཆེས་ན་ལམ་དེར་བཞུད་ཅིག །
en: If you don’t believe me, follow that road.

source: ལམ་དེར་བཞུད་ནས་རྟོགས་ཤིག་དང་། །
en: Follow that road and observe.

source: དེའི་ཚེ་ང་ལ་ཡིད་ཆེས་པར་འགྱུར་རོ་ཞེས་ཟེར་ནས། །
en: Then you will believe me.’

source: དེའི་ཚེ་དེས་གླེན་པའི་དྲ་བ་ཞེས་བྱ་བའི་གཉིད་ཀྱིས་ནོན་པར་བྱས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནུབ་མོའི་དུས་ཀྱི་ཚེ་སོང་ནས་རལ་གྲི་ཟླ་བ་ལྟར་སྣང་བ་བདག་འཚོ་བར་བྱེད་པ་ཞེས་བྱ།
en: “So I made the rākṣasī enter the sleep named Ignorance’s Net, and I went out at night, armed with a sword that glowed like moonlight.

source: ཐོགས་ནས་གཡས་ཕྱོགས་ཀྱི་ལམ་སྲང་བཟུང་སྟེ། སོང་བ་ལས་རིམ་གྱིས་ལྕགས་ཀྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་ནས་
en: I took the road that led south, and followed it until eventually I came to an iron fortress.

source: ཁོ་ར་ཁོར་ཡུག་ཏུ་བསྐོར་ཀྱང་དེས་སྒོ་མ་མཐོང་ངོ་། །
en: I walked around it, but could not find a door.

source: དེ་ནས་ལྕགས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་ཤིང་ཙམ་པ་ཀ་ཞིག་འདུག་པ་དེ་ལ་འཛེགས་ཏེ།
en: However, there was a magnolia tree beside the iron fortress, and so I climbed up it.

source: དེ་ནས་ངས་ལུད་པའི་སྒྲ་བྱས་པ་དང་།
en: I made the sound of spitting, and

source: སྐྱེས་བུ་ཚོང་པ་དེ་དག་ན་རེ་ཚོང་དཔོན་ཆེན་པོ་མཁྱེན་པར་མཛོད་ཅིག །བདག་ཅག་ནི་ལྕགས་ཀྱི་གྲོང་ཁྱེར་དུ་སྩལ་ཏོ། །ཞེས་སྨྲས་ནས་དེའི་ཚེ་ཉི་མ་རེ་རེ་ཞིང་ཡང་མི་བརྒྱ་བརྒྱ་ཁྲིད་དེ་ཟའོ། །
en: the merchants inside heard me, “They said, ‘Great head merchant, know this! We have been thrown into this iron fortress. Each day a hundred men are taken and eaten.

source: ཟོས་ནས་རུས་པ་རྣམས་ལྕགས་ཀྱི་གྲོང་ཁྱེར་དེ་ཉིད་དུ་འདོར་བ་ཡང་
en: When they have been eaten, their bones are scattered around the iron fortress.’

source: དེ་དག་གིས་ང་ལ་སྔོན་བྱུང་བ་བཞིན་དུ་སྨྲས་ནས་ངས་དེའི་ཚེ་ཤིང་ཙམ་པ་ཀ་ལས་བབས་ཏེ་
en: “That is how they described what had happened to them. I climbed down the magnolia tree and

source: གཡས་ཕྱོགས་ཀྱི་ལམ་སྲང་དེ་བཟུང་ནས་མྱུར་དུ་མྱུར་བར་སོང་བ་སྟེ།
en: went quickly back up the southern road.

source: དེ་ནས་སླར་ཕྱིན་ཏོ། །དེ་ནས་སྙན་པར་བྱེད་པ་དེ་ན་རེ་དེད་དཔོན་ཆེན་པོ་ཁྱོད་ཀྱིས་གཟིགས་སམ་ཞེས་ཟེར་ནས་
en: “When I returned to the house, the lamp asked me, ‘Head merchant, did you see?’

source: ངས་མཐོང་ངོ་། །ཞེས་སྨྲས་སོ།
en: “I answered, ‘I saw,’

source: དེའི་ཚེ་ངས་དེ་ལ་ཐབས་ཅི་ཡོད་ཅེས་དྲིས་ན།
en: and then asked it, ‘What can I do?’

source: དེ་ནས་སྙན་པར་བྱེད་པ་དེས་འདི་སྐད་ཅེས་སྨྲས་ཏེ།
en: “The lamp said,

source: ལྷ་ཐབས་གང་གིས་བདེ་བ་དང་། ཉོན་མོངས་པ་མེད་པར་སིང་གྷ་ལའི་གླིང་ནས་འབྱུང་ཞིང་སླར་འཛམ་བུའི་གླིང་མཐོང་བར་འགྱུར་བའི་ཐབས་མཆིས་སོ། །
en: ‘Lord, I have a way by which you can comfortably and happily leave Siṃhala Island and see Jambudvīpa once more.’

source: འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “It said,

source: ལྷ་རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་ཞེས་བགྱི་བ་དམན་པ་དང་ཕོངས་པ་ལ་སྨན་པ་ཞིག་མཆིས་ཏེ།
en: ‘There is a divine king of horses named Bālāha who has compassion for the desolate and destitute.

source: རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་དེ་སྨན་སྦེད་ཐམས་ཅད་ཅེས་བགྱི་བ་འཚལ་ཏེ། །
en: Bālāha, the king of horses, eats the herb named sarvaśetāna

source: གསེར་གྱི་བྱེ་མའི་ཐང་བུ་ལ་ཕར་འགྲེ་ཚུར་འགྲེ་བར་བགྱིད་དོ།
en: rolls back and forth on the golden sand,

source: ཕར་འགྲེས་ཚུར་འགྲེས་ནས་ལུས་སྤྲུག་གོ། །
en: shakes his body,

source: སྤྲུགས་ནས་ཕ་རོལ་དུ་སུ་འགྲོ། ཕ་རོལ་དུ་སུ་འགྲོ་ཞེས་སྨྲའོ། །
en: and then asks, “Who is going to cross over to the far shore?”

source: ཁྱོད་ཀྱིས་ལྷ་བདག་ཕ་རོལ་དུ་མཆིའོ་ཞེས་བགྱིས་ཤིག་
en: You should then say, “Lord, I am going to cross over to the far shore.”

source: ཅེས་དེ་སྐད་བསྒོ་བ་ཐོས་ནས་དེ་སྲིན་མོའི་དྲུང་དུ་ཉེ་བར་སོང་ནས་ལྷན་ཅིག་ཏུ་ཉལ་བ་དང་།
en: “Once the lamp had told me this, I went to lie down next to the rākṣasī. She awoke and asked me,

source: དེ་སད་ནས་འཕགས་པའི་སྲས་ལུས་རེ་གྲང་བ་ཞིག་ཅེས་ཟེར་ནས་ངས་དེ་ལ་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་དུ་བཤང་གཅི་བྱེད་དུ་སོང་བས།
en: ‘Noble son, why is your body cold?’ “I answered, ‘I went outside the town to defecate and urinate.

source: དེའི་ཕྱིར་ལུས་གྲང་མོ་གྲང་བར་གྱུར་ཏོ།
en: That’s why my body has become cold.’

source: སླར་དེ་གཉིད་ཀྱིས་ལོག་སྟེ་
en: And so she went back to sleep.

source: ཉི་མ་ཤར་བའི་ཚེ་ལངས་སོ། །
en: “At sunrise I got up

source: དེ་ནས་སྐྱེས་བུ་ཚོང་པ་རྣམས་ལ་ཁྱེད་ཚུར་ཤོག་ཤིག །
en: and said to all the merchants, ‘Come with me.

source: གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་དུ་འདོང་ངོ་
en: We are going outside the town.’

source: དེ་དག་ཐམས་ཅད་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་དུ་འདོང་ངོ་།
en: “Then we all left the town.

source: དེ་དག་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་དུ་དོང་ནས་ངལ་བསོས་སོ།
en: When we were outside the town and had sat down,

source: སུའི་ཆུང་མ་དག་ཇི་ལྟ་བུས་མཛའ་བར་གྱུར་ཅེས་དྲིས་པ་དང་།
en: I asked them, ‘How affectionate are your wives toward you?’

source: ཁ་ཅིག་གིས་ནི་བདག་ལ་ཤིན་ཏུ་མཛའ་བར་བྱེད་དོ་ཞེས་སྨྲས་སོ། །
en: “Some said, ‘She is very loving toward me.’

source: ཁ་ཅིག་གིས་ནི་བདག་ལ་ལྷའི་རོའི་རོ་མཆོག་དང་ལྡན་པའི་ཟས་ཀྱིས་འཛིན་པར་བགྱིད་དོ་ཞེས་སྨྲས་སོ།
en: “Some said, ‘She takes care of me with food that has perfect, divine flavors.’

source: ཁ་ཅིག་གིས་ནི་གོས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་འཛིན་ཏོ་ཞེས་སྨྲས་སོ། །
en: “Some said, ‘She provides me with all kinds of clothes.’

source: ཁ་ཅིག་གིས་ནི་བདག་ལ་ཅོད་པན་དང་། རྣ་ཆ་དང་སེ་མོ་དོའི་ཆུན་པོས་འཛིན་ཏོ་ཞེས་སྨྲས་སོ། །
en: “Some said, ‘She gives me diadems, earrings, and necklaces.’

source: ཁ་ཅིག་གིས་ནི་བདག་གི་ལུས་ལ་བྲེལ་བ་མ་མཆིས་སོ་ཞེས་སྨྲས་སོ། །
en: “Some said, ‘I don’t have to do any physical work.’

source: ཁ་ཅིག་གིས་ནི་བདག་ལ་ཙན་དན་དང་། གླ་རྩི་དང་། ག་པུར་གྱིས་འཛིན་ཏོ་ཞེས་སྨྲས་ཏེ།
en: “Some said, ‘She cares for me with sandalwood, musk, and camphor.’

source: དེ་ལྟར་དེ་དག་གིས་གཏམ་བྱས་ནས་ངས་དེའི་ཚེ་སྐྱེས་བུ་ཚོང་པ་དེ་དག་ལ་གང་བདག་ཅག་སྲིན་མོ་ལ་ཆགས་པར་བྱ་བའི་ནི་མི་རིགས་སོ་ཞེས་སྨྲས་པ་དང་། །
en: “After the merchants told me these things, I said to them, ‘It is not right for us to be attached to rākṣasīs in this way.’

source: དེ་དག་མྱོས་ནས་ཚོང་དཔོན་ཆེན་པོ་སིང་གྷ་ལའི་གླིང་ན་གནས་པའི་སྲིན་མོ་ལགས་མད་མད་ཅེས་ཟེར་ནས། །
en: “They were disturbed by my words, and asked, ‘Great head merchant, is it true that they are the rākṣasīs who live on Siṃhala Island?’

source: དེའི་ཚེ་ངས་དེ་དག་ལ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་བདེན་ནོ་བདེན་ནོ། །
en: “I answered, ‘It is true, indeed it is true. By the Buddha, Dharma, and Saṅgha,

source: འདི་ནི་མི་མ་ཡིན་ཏེ་སྲིན་མོའོ་ཞེས་སྨྲས་སོ། །
en: they are not humans. They are rākṣasīs.’

source: དེ་ནས་སྐྱེས་བུ་ཚོང་པ་དེ་དག་གིས་བདག་ཅག་ལ་སྐྱབས་ཅི་ཡོད། །
en: “The merchants asked me, ‘What can we do?

source: རྟེན་ཅི་ཡོད་ཅེས་སྨྲས་པ་དང་། །
en: Do you have a plan for us?’

source: ངས་དེ་དག་ལ་སིང་གྷ་ལའི་གླིང་ན་རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་ཞེས་བྱ་བ་དམན་པ་དང་ཕོངས་པ་ལ་སྙིང་རྗེ་བར་བྱེད་པ་ཞིག་ཡོད་དེ།
en: “I told them, ‘On Siṃhala Island there is Bālāha, the king of horses, who has compassion for the desolate and destitute.

source: སྨན་སྦེད་ཐམས་ཅད་ཅེས་བྱ་བ་ཟོས་ནས་གསེར་གྱི་བྱེ་མའི་ཐང་བུ་ལ་ཕར་འགྲེ་ཚུར་འགྲེ་བྱས་ཏེ་ལུས་སྤྲུག་གོ།
en: He eats the herb called sarvaśetāna , rolls back and forth on the golden sand,

source: ལུས་སྤྲུགས་ནས་དེའི་ཚེ་སུ་ཕ་རོལ་དུ་འགྲོ། སུ་ཕ་རོལ་དུ་འགྲོ་ཞེས་ཚིག་ལན་གསུམ་སྨྲས་པ་དང་།
en: shakes his body, and then asks three times, “Who is going to cross over to the far shore? Who is going to cross over to the far shore? Who is going to cross over to the far shore?”

source: བདག་ཅག་དེར་འདོང་ངོ་ཞེས་སྨྲས་སོ།
en: We should go to him.’

source: དེ་ནས་སྐྱེས་བུ་ཚོང་པ་དེ་དག་ང་ལ་བདག་ཅག་ནམ་བཞུད་ཅེས་ཟེར་ནས།
en: “The merchants asked me, ‘On what day should we go?’

source: ངས་དེ་དག་ལ་ཉི་མ་གསུམ་ན་ངེས་པར་འདོང་གིས་
en: “I answered, ‘We should definitely leave in three days’ time.

source: སྐྱེས་བུ་སོ་སོ་ནས་རྒྱགས་དང་ཆོས་ཤིག་
en: Each person should prepare provisions for the journey.’

source: དེ་དག་དང་དམ་བཅས་ནས་སླར་གྲོང་ཁྱེར་དུ་དོང་སྟེ་བདག་བདག་གི་ཁྱིམ་དུ་ཕྱིན་པ་དང་།
en: “They promised they would and returned to town, each to their own home.

source: དེ་དག་ལ་སྲིན་མོ་རྣམས་ཀྱིས་ངལ་ལམ།
en: “The rākṣasī asked me, ‘Are you tired?

source: ཆད་དམ། །
en: Are you weary?

source: ཁྱེད་ཀྱིས་སྐྱེད་མོས་ཚལ་དགའ་བར་བྱེད་པ་མཐོང་ངམ་
en: Have you seen the delightful gardens and the delightful bathing pools?’

source: དེ་དག་གིས་ངེད་ཀྱིས་ཆུང་ཟད་ཀྱང་མ་མཐོང་ངོ་ཞེས་སྨྲས་སོ། །
en: “I answered, ‘I haven’t seen any.’

source: དེ་ནས་སྲིན་མོ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The rākṣasī then said,

source: འཕགས་པའི་སྲས་སིང་གྷ་ལའི་གླིང་འདི་ན་སྐྱེད་མོས་ཚལ་དགའ་བར་བྱེད་པ་མེ་ཏོག་གིས་ཡོངས་སུ་གང་བ་རྣམ་པ་སྣ་ཚོགས་དང་། རྫིང་བུ་བརྒྱ་ཕྲག་དུ་མ་མཆིས་སོ་ཞེས་སྨྲས་ནས།
en: ‘Noble son, in this Siṃhala Island there are pleasing gardens of all kinds that are completely filled with flowers, and there are many hundreds of bathing pools.’

source: དེས་ཉི་མ་གསུམ་ན་སྐྱེད་མོས་ཚལ་གྱིས་དེ་དག་དང་རྫིང་བུ་མེ་ཏོག་གིས་ཡོངས་སུ་གང་བ་རྣམ་པ་སྣ་ཚོགས་དེ་དག་ལྟར་འགྲོའོ། །
en: “I said, ‘I will go to those gardens and the various flower-filled pools in three days’ time.

source: དེའི་ཚེ་མེ་ཏོག་བཟང་པོ་དག་ཀྱང་ཁྱེར་ཏེ་འོང་གིས་རྒྱགས་བཟང་དུ་གྱིས་ཤིག་
en: I will gather beautiful flowers there and then return. Therefore you should prepare good traveling provisions for me.’

source: དེས་འཕགས་པའི་སྲས་དེ་བཞིན་དུ་བགྱིའོ་ཞེས་སྨྲས་སོ། །
en: “She said, ‘Noble son, I will do so.’

source: དེ་ནས་དེས་ལུས་ལ་བསམས་ཏེ། སྲིན་མོ་འདི་དག་གིས་རྒྱུས་ཤེས་པར་གྱུར་ན་ནི་བདག་ཅག་གི་སྲོག་གཅོད་དོ་
en: “I contemplated my predicament, thinking, ‘These rākṣasīs will kill us if they find out.’

source: སྙམ་དུ་དེ་ལྟར་ལུས་ཀྱི་རྗེས་སུ་བསམས་ནས་ཁ་རོག་སྟེ་འདུག་པ་དང་།
en: I remained silent, contemplating this predicament.

source: མོས་ཟས་བཟང་པོ་བྱིན་ནས་ཟོས་ཏེ་ཤུགས་ཕྱུང་ནས།
en: The rākṣasī served me good food, and as I ate it, I sighed.

source: སྲིན་མོ་དེས་འཕགས་པའི་སྲས་ཅིའི་སླད་དུ་ཤུགས་འབྱིན་ཅེས་སྨྲས་སོ།
en: “The rākṣasī asked me, ‘Noble son, why did you sigh?’

source: དེ་ནས་ངས་མོ་ལ་འཛམ་བུའི་གླིང་གི་མི་དག་ནི་བདག་གི་ཡུལ་ལ་དགའ་འོ་ཞེས་སྨྲས་པ་དང་།
en: “I said to her, ‘The people of Jambudvīpa and my homeland are so pleasant.’

source: འཕགས་པའི་སྲས་བདག་གི་ཡུལ་གྱིས་ཅི་ཞིག་བགྱི། །
en: ‘Noble son, what would you do in your homeland?

source: སིང་གྷ་ལའི་གླིང་འདི་ཉིད་ན་ཁྱོད་ཀྱི་ཟས་ཀྱི་ཁང་པ་དང་། སྐོམ་གྱི་ཁང་པ་དང་། གོས་ཀྱི་ཁང་པ་སྣ་ཚོགས་དང་།
en: In this Siṃhala Island you have a home with food, a home with drink, a home with clothes,

source: ཁྱེད་ཀྱི་སྐྱེད་མོས་ཚལ་དགའ་བར་བགྱིད་པ་སྣ་ཚོགས་མཆིས་ཀྱིས་ལྷའི་བདེ་བ་མྱོང་བར་མཛོད་ཅིག །
en: a variety of delightful gardens, and a variety of delightful bathing pools. Enjoy these divine pleasures.

source: འཛམ་བུའི་གླིང་ལ་མྱ་ངན་བགྱིར་ཅི་མཆིས་ཞེས་ཟེར་ནས་
en: Why be sorrowful in Jambudvīpa?’

source: དེའི་ཚེ་ང་ཁ་རོག་སྟེ་འདུག་གོ།
en: I said nothing in reply.

source: དེའི་ཉིན་མོ་འདས་ནས་ཕྱི་དེ་ཉིན་ཟས་བཟང་པོ་རྒྱགས་དང་ལྡན་པ།
en: “That day passed, and on the second day, my provisions of good food were quickly prepared.

source: དེ་དག་ཐམས་ཅད་སྟ་གོན་བྱས་ནས་ཉི་མ་གསུམ་པ་ལ་ནང་པར་སྔར་དེ་དག་ཐམས་ཅད་དོང་ནས་གྲོང་ཁྱེར་གྱི་སྒོར་བྱུང་ངོ་། །
en: Everyone had made his preparations, and at dawn on the third day we all left the city, coming out through its gate.

source: བྱུང་ནས་སླར་སུས་ཀྱང་སིང་གྷ་ལའི་གླིང་དུ་མི་བལྟ་བར་དམ་བཅས་སོ། །
en: When we were outside, we agreed that not one of us would turn to look back at Siṃhala Island.

source: དེ་འདྲ་བའི་དམ་བཅས་ནས་མྱུར་བ་མྱུར་བར་སྐྱེན་པ་སྐྱེན་པར་དོང་བ་དང་།
en: After we had made that agreement, we hurried as quickly as we could,

source: རིམ་གྱིས་རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་ག་ལ་བ་དེར་ཕྱིན་ནས།
en: and eventually reached the location of Bālāha, the king of horses.

source: རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་སྨན་སྦེད་ཐམས་ཅད་ཅེས་བྱ་བ་ལ་མྱངས་སོ། །སྨན་མྱངས་ནས་གསེར་གྱི་བྱེ་མའི་ཐང་བུ་ལ་ཕར་འགྲེ་ཚུར་འགྲེ་བར་བྱེད་དོ། །བྱས་ནས་ལུས་སྤྲུག་གོ། །
en: “Bālāha, the king of horses, was enjoying the sarvaśetāna herb. When he had finished enjoying it, he rolled back and forth on the golden sand and shook his body.

source: གང་གི་ཚེ་ན་ལུས་སྤྲུགས་པ་དེའི་ཚེ་སིང་གྷ་ལའི་གླིང་ཡང་འགུལ་ལོ།
en: When he shook his body, the island of Siṃhala shook.

source: དེས་ཕ་རོལ་དུ་སུ་འགྲོ། ཕ་རོལ་དུ་སུ་འགྲོ་ཞེས་ཚིག་ལན་གསུམ་སྨྲས་པ་དང་། །
en: “He asked three times, ‘Who is going to cross over to the far shore? Who is going to cross over to the far shore? Who is going to cross over to the far shore?’

source: དེ་ནས་སྐྱེས་བུ་ཚོང་པ་དེ་དག་གིས་བདག་ཅག་ཕ་རོལ་ཏུ་མཆིའོ་ཞེས་སྨྲས་སོ། །
en: “The merchants said, ‘We are going to cross over to the far shore.’

source: དེ་ནས་རྟའི་རྒྱལ་པོ་བ་ལ་ཧ་དེས་ཁྱོད་ལས་སུས་ཀྱང་སིང་གྷ་ལའི་གླིང་ལ་མི་བལྟ་བར་བྱའོ།
en: “Bālāha, the king of horses, said to us, ‘None of you must look back at Siṃhala Island.

source: སུས་ཀྱང་མིག་གིས་མི་བལྟ་བར་བྱའོ། །
en: None of you must turn your eyes toward Siṃhala Island.’

source: ཞེས་དེ་སྐད་སྨྲས་ཏེ་དེ་འདྲ་བའི་དམ་བཅས་ནས་དེའི་ཚེ་ཐོག་མ་ཁོ་ནར་བཞོན་ནོ། །དེའི་འོག་ཏུ་ཚོང་པ་ལྔ་བརྒྱ་ཞོན་ནོ། །
en: “We agreed to do as he said. Then first I alone mounted him, and then the five hundred merchants mounted him.

source: གང་གི་ཚེ་དེ་དག་ཞོན་པ་དེའི་ཚེ་སིང་གྷ་ལའི་གླིང་ན་གནས་པའི་སྲིན་མོ་དག་སྒྲ་ཅ་ཅོ་ཟེར་ཞིང་ཕྱི་བཞིན་དུ་སྙེག་གོ། །
en: When we were all mounted, the rākṣasīs who lived on Siṃhala Island came running after us, making a great clamor,

source: ངུ་ཞིང་སྙིང་རྗེ་རྗེ་ལྟར་སྨྲ་བ་དང་། །
en: weeping and wailing pitifully.

source: དེ་ནས་དེ་དག་གིས་ངོ་སླར་ལོག་སྟེ་བལྟས་སོ། །གང་གི་ཚེ་དེ་དག་གིས་བལྟས་པ་དེའི་ཚེ་དེ་དག་ཁ་བུབ་ཏུ་ལྷུང་ངོ་། །
en: Hearing the noise, the merchants turned round and looked back at them, and when they did so they fell headlong into the water.

source: གང་གི་ཚེ་ན་དེ་དག་ཆུའི་ནང་དུ་ལྷུང་བ་དེའི་ཚེ་སྲིན་མོ་དག་གིས་དྲངས་ཤིང་དྲངས་ཤིང་ཟོས་སོ།
en: When they had fallen into the water, the rākṣasīs pulled them out and ate them.

source: དེའི་ཚེ་ང་གཅིག་པུས་འཛམ་བུ་གླིང་དུ་ཕྱིན་ཏེ། །
en: “I arrived in Jambudvīpa alone.

source: དེའི་ཚེ་འགྲམ་དུ་ཉེ་བ་དང་རྟའི་རྒྱལ་པོ་བ་ལ་ཧས་ང་ལ་ལན་གསུམ་བསྐོར་ཏེ། ཕྱག་བྱས་ནས་དེ་ཉིད་དུ་སོང་ངོ་། །
en: When we reached the shore, I circumambulated Bālāha, the king of horses, three times, bowed to him, and departed.

source: དེ་ནས་ང་ཡང་སོང་ནས་རིམ་གྱིས་བདག་གི་ཁྱིམ་དུ་ཕྱིན་ཏེ།
en: I journeyed toward my home and eventually arrived there.

source: དེའི་ཚེ་ཕ་དང་མས་ངའི་མགུལ་ནས་འཇུས་ནས་ངུས་པ་དང་། རླངས་པས་དེ་གཉིས་ཀྱི་མིག་རུ་གས་ནས་མཐོང་བར་གྱུར་ཏོ། །
en: My father and mother embraced me and wept, and their tears dissolved their cataracts so they regained their sight.

source: དེ་ནས་ཕ་མ་དང་ལྷན་ཅིག་ཏུ་ངལ་བསོས་ནས་དེས་དེ་དག་ལ་སྔོན་ཇི་ལྟར་བྱུང་བ་ཐམས་ཅད་བཟླས་པ་དང་།
en: “Then I sat with my parents and told them everything that had happened.

source: ཕ་མས་དེ་ལ་སྨྲས་པ། །
en: My parents said,

source: བུ་ཁྱོད་གསོན་བཞིན་དུ་རྙེད་དེ།
en: ‘Son, we have got you back alive.

source: ངེད་ལ་ནོར་ནི་མི་དགོས་སོ།
en: We do not need wealth.

source: རྒས་པའི་ཚེ་ཁར་བར་གྱུར་པའོ།
en: We only need a walking stick for when we are old,

source: འཆི་བའི་ཚེ་ཟས་སྦྱིན་པར་བྱེད་པའོ། །
en: someone to make food offerings to us when we have died,

source: ཤི་ནས་མགོན་ཡོད་པར་བྱེད་པའོ། །
en: and someone to be our protector when we are dead.

source: བུ་ནི་རླུང་བསིལ་བར་བྱེད་པའོ།
en: Son, you have brought us delight like a cooling breeze.’

source: ཞེས་ཕ་དང་མས་སྨྲས་ཏེ།
en: That is what my parents said to me.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ང་དེད་དཔོན་དུ་གྱུར་པའི་ཚེ་འདི་ལྟ་བུའི་སྡུག་བསྔལ་བ་མྱོང་ངོ་། །
en: “Sarva­nīvaraṇa­viṣkambhin, those are the sufferings I experienced when I was a head merchant.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་རྟ་བ་ལ་ཧར་གྱུར་པས་ང་འཆི་བའི་འཇིགས་པ་དེ་འདྲ་བ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་སོ།
en: Bodhisattva Mahāsattva Avalokiteśvara was Bālāha, the king of horses, and he rescued me from the fear of death.

source: འདི་ལྟ་སྟེ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་
en: “Sarva­nīvaraṇa­viṣkambhin, it is like this:

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ངས་བགྲང་མི་ནུས་ཏེ།
en: I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit, but

source: བ་སྤུའི་ཁུང་བུ་རེ་རེའི་གཏམ་ཆུང་ཟད་ཅིག་བཤད་དོ།
en: I can say just a little about his pores.

source: གསེར་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་དྲི་ཟ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་གནས་ཏེ།
en: A trillion gandharvas dwell in a pore named Suvarṇa.

source: དེ་དག་འཁོར་བའི་སྡུག་བསྔལ་བར་མི་འགྱུར་ཞིང་བདེ་བ་དམ་པ་དང་ལྡན་པ་ཡིན་ཏེ། །
en: They do not experience the sufferings of saṃsāra and are satisfied by perfect happiness.

source: ལྷའི་དངོས་པོ་དག་འབྱུང་བར་འགྱུར་གྱི། འདོད་ཆགས་ཅན་དུ་མི་འགྱུར།
en: They perceive divine objects but are free from attachment.

source: ཞེ་སྡང་ཅན་དུ་མི་འགྱུར། ཁོང་ཁྲོ་བའི་སེམས་མི་སྐྱེད།
en: They have no aversion, they do not become angry,

source: དེ་དག་ལས་གང་ལ་ཡང་གནོད་པའི་སེམས་མི་སྐྱེད་དེ།
en: and they never have malice.

source: དེ་དག་དུས་ཐམས་ཅད་དུ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་ལ་གནས་པ་ཡིན་ཏེ། དུས་ཐམས་ཅད་དུ་ཆོས་འདོད་པ་ཡིན་ནོ།
en: They all dwell on the noble eightfold path and always aspire to the Dharma.

source: གསེར་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་ན་སྣང་བ་ཞེས་བྱ་བའི་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ཡོད་དེ།
en: in this pore named Suvarṇa there is a wish-fulfilling jewel named Avabhāsa.

source: གང་དང་གང་གི་ཚེ་དྲི་ཟ་དེ་དག་བསམ་པ་སེམས་པ་དེའི་ཚེ་དེ་དག་གི་བསམ་པ་འགྲུབ་པར་འགྱུར་རོ།
en: Whenever the gandharvas wish for something, their wishes are fulfilled.

source: དེའི་ཚེ་གསེར་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་ལས་འདས་ནས་ནག་པོ་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་དྲང་སྲོང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཡོད་དེ།
en: “Beyond the pore named Suvarṇa, there is a pore named Kṛṣṇa, within which a trillion rishis dwell.

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་གཅིག་པ། །
en: Some have one clairvoyance;

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་གཉིས་པ།
en: some have two clairvoyances;

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་གསུམ་པ། །
en: some have three clairvoyances;

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་བཞི་པ།
en: some have four clairvoyances;

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་ལྔ་པ།
en: some have five clairvoyances;

source: ལ་ལ་ནི་མངོན་པར་ཤེས་པ་དྲུག་པའོ། །
en: and some have the six clairvoyances.

source: བ་སྤུའི་ཁུང་བུ་དེ་ན་དངུལ་གྱིས་གཞི་ལ་གསེར་གྱི་རི་དངུལ་གྱི་རྩེ་མོ་པད་མོ་དམར་པོས་བརྒྱན་པ་དེ་འདྲ་བའི་
en: “Within that pore the ground is silver and the mountains are gold with silver peaks adorned by rubies.

source: རི་བདུན་ཅུ་རྩ་བདུན་ཡོད་དེ།
en: There are seventy-seven such mountains,

source: རི་རེ་རེ་ཞིང་ཡང་དྲང་སྲོང་བརྒྱད་ཁྲི་གནས་སོ། །
en: and on each of those mountains live eighty thousand rishis.

source: དྲང་སྲོང་དེ་དག་གི་ཤིང་དཔག་བསམ་ནི་འདི་འདྲ་སྟེ། སྡོང་པོ་ནི་དམར་པོ། འདབ་མ་ནི་གསེར་དང་། དངུལ་ལས་བྱས་པ་རིན་པོ་ཆེར་སྣང་བའོ། །
en: Those rishis have leaf huts where there are wish-fulfilling trees with red trunks and gold and silver leaves that shine like jewels.

source: ཤིང་དཔག་བསམ་རེ་རེ་དང་། ཉེ་བ་ན་ནི་རྫིང་བུ་བཞི་ཡོད་དེ།
en: There are four pools near each wish-fulfilling tree.

source: ལ་ལ་ནི་ཆུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པས་ཡོངས་སུ་གང་བ།
en: Some are filled with water that has the eight qualities,

source: ལ་ལ་ནི་ལྷའི་མེ་ཏོག་གིས་ཡོངས་སུ་གང་བའོ། །
en: and some are completely filled with divine flowers.

source: ཕྱོགས་དེ་དང་ཉེ་བ་ན་ལྷའི་བྱི་རུའི་ཤིང་གིས་ཡོངས་སུ་མཛེས་པར་བྱས་པའི་དཔག་བསམ་གྱི་ཤིང་དག་སྣང་སྟེ། ལྷའི་རྒྱན་དག་ནི་འཕྱང་ཅོད་པན་དང་། རྣ་ཆ་དག་ཀྱང་རབ་ཏུ་འཕྱང་། །
en: The area around them is completely adorned by wish-fulfilling trees that are divine coral trees hung with divine adornments; hung with diadems and earrings;

source: སེ་མོ་དོ་དང་། སེ་མོ་དོའི་ཕྱེད་པ་དག་ཀྱང་རབ་ཏུ་འཕྱང་། །
en: hung with one hundred and eight-string necklaces and sixty-four-string necklaces;

source: གདུ་བུ་དག་ཀྱང་རབ་ཏུ་འཕྱང་སྟེ།
en: and hung with bracelets;

source: ལོ་མ་ནི་རིན་པོ་ཆེ་དང་། གསེར་ལས་བྱས་པའོ།
en: and their leaves are made of jewels and gold.

source: དེ་ན་ཤིང་དཔག་བསམ་རེ་རེ་ཞིང་ཡང་དྲི་ཟ་བརྒྱ་བརྒྱ་གནས་ཏེ།
en: “In each of those wish-fulfilling trees there live a hundred gandharvas.
